/****************************************************************************
*
*   Copyright (c) 2012, BeiJing EFLAG Technology Co., LTD.
*   All rights reserved.
*
*   文件名称 ：systick.c
*   摘 要    ： 
*
*   当前版本 ： 
*   作 者    ： EFLAG
*   完成日期 ： 
*
*   取代版本 ：
*   原作者   ： 
*   修改内容 ：
*   完成日期 ：2012.08.01 
*
******************************************************************************/

/*************头文件*********************************************************/
#include "systick.h"	

/*************宏定义**********************************************************/
#define TMR_COUNT	1		/* 软件定时器的个数 */
SOFT_TMR g_Tmr[TMR_COUNT];

/*******************************************************************************
函数名：SoftTimerDec
输  入: 定时器变量指针,每隔1ms减1
输  出:
功能说明：
*******************************************************************************/
static void SoftTimerDec(SOFT_TMR *_tmr)
{
	if (_tmr->count > 0)
	{
		if (--_tmr->count == 0)
		{
			_tmr->flag = 1;
		}
	}
}

/*******************************************************************************
函数名：SysTick_ISR
输  入:
输  出:
功能说明：SysTick中断服务程序，每隔1ms进入1次
*********************************************************************************/
void SysTick_ISR(void)
{
	uint8_t i;

	for (i = 0; i < TMR_COUNT; i++)
	{
		SoftTimerDec(&g_Tmr[i]);
	}

}

/*******************************************************************************
函数名：DelayMS
输  入: 延迟长度，单位1 ms. 延迟精度为正负1ms
输  出:
功能说明：延时函数。占用软件定时器0
*******************************************************************************/
void DelayMs(uint32_t n)
{
	/* 避免 n = 1 出现主程序死锁 */
	if (n == 1)
	{
		n = 2;
	}
	g_Tmr[0].count = n;
	g_Tmr[0].flag = 0;

	/* while 循环体最好让CPU进入IDLE状态，已降低功耗 */
	while (1)
	{
		CPU_IDLE();

		if (g_Tmr[0].flag == 1)
		{
			break;
		}
	}
}

/*******************************************************************************
函数名：StartTimer
输  入: 
	_id ： 定时器ID (1 - 3)
	_period : 周期，单位ms
输  出:
功能说明：
*******************************************************************************/
void StartTimer(uint8_t _id, uint32_t _period)
{
	if (_id >= TMR_COUNT)
	{
		return;
	}

	g_Tmr[_id].count = _period;
	g_Tmr[_id].flag = 0;
}

/*******************************************************************************
函数名：StartTimer
输  入: 定时器ID (0 - 3)
输  出: 返回 0 表示定时未到， 1表示定时到
功能说明：
*******************************************************************************/
uint8_t CheckTimer(uint8_t _id)
{
	if (_id >= TMR_COUNT)
	{
		return 0;
	}

	if (g_Tmr[_id].flag == 1)
	{
		g_Tmr[_id].flag = 0;
		return 1;
	}
	return 0;
}

/****** (C) 版权2012北京亿旗创新科技发展有限公司 ******文档结束*************/
